---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.GetPathReinforcementsInHost
source: html/a508c6b3-0fce-0572-e17c-bcc06be368c6.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.GetPathReinforcementsInHost Method

Returns all PathReinforcement elements hosted by the referenced element.

## Syntax (C#)
```csharp
public IList<PathReinforcement> GetPathReinforcementsInHost()
```